package com.chess.constants;

public class InitDataConstants {
    public static final String chessArray[][] = {
            {"1","帅","jiang","RED","1","1","NONE","11"},
            {"2","士","shi","RED","1","2","NONE","12"},
            {"3","士","shi","RED","1","3","NONE","13"},
            {"4","相","xiang","RED","1","4","NONE","14"},
            {"5","相","xiang","RED","1","5","NONE","15"},
            {"6","马","ma","RED","1","6","NONE","16"},
            {"7","马","ma","RED","1","7","NONE","17"},
            {"8","车","che","RED","1","8","NONE","18"},
            {"9","车","che","RED","2","1","NONE","21"},
            {"10","炮","pao","RED","2","2","NONE","22"},
            {"11","炮","pao","RED","2","3","NONE","23"},
            {"12","兵","bing","RED","2","4","NONE","24"},
            {"13","兵","bing","RED","2","5","NONE","25"},
            {"14","兵","bing","RED","2","6","NONE","26"},
            {"15","兵","bing","RED","2","7","NONE","27"},
            {"16","兵","bing","RED","2","8","NONE","28"},
            {"17","将","jiang","BLACK","3","1","NONE","31"},
            {"18","士","shi","BLACK","3","2","NONE","32"},
            {"19","士","shi","BLACK","3","3","NONE","33"},
            {"20","象","xiang","BLACK","3","4","NONE","34"},
            {"21","象","xiang","BLACK","3","5","NONE","35"},
            {"22","马","ma","BLACK","3","6","NONE","36"},
            {"23","马","ma","BLACK","3","7","NONE","37"},
            {"24","车","che","BLACK","3","8","NONE","38"},
            {"25","车","che","BLACK","4","1","NONE","41"},
            {"26","炮","pao","BLACK","4","2","NONE","42"},
            {"27","炮","pao","BLACK","4","3","NONE","43"},
            {"28","卒","bing","BLACK","4","4","NONE","44"},
            {"29","卒","bing","BLACK","4","5","NONE","45"},
            {"30","卒","bing","BLACK","4","6","NONE","46"},
            {"31","卒","bing","BLACK","4","7","NONE","47"},
            {"32","卒","bing","BLACK","4","8","NONE","48"},
    };

    public static final String xArray[] = {"1","1","1","1","1","1","1","1",
                                           "2","2","2","2","2","2","2","2",
                                           "3","3","3","3","3","3","3","3",
                                           "4","4","4","4","4","4","4","4"};

    public static final String yArray[] = {"1","2","3","4","5","6","7","8",
            "1","2","3","4","5","6","7","8",
            "1","2","3","4","5","6","7","8",
            "1","2","3","4","5","6","7","8"};

    public static final String locationArray[] = {"11","12","13","14","15","16","17","18",
            "21","22","23","24","25","26","27","28",
            "31","32","33","34","35","36","37","38",
            "41","42","43","44","45","46","47","48"};

    public static void main(String[] args) {
        InitDataConstants dataConstants = new InitDataConstants();
    }
}
